[
    {
      "name": "Indian Institute of Management Ahmedabad",
      "short_name": "IIM-Ahmedabad",
      "city": "Ahmedabad",
      "state": "Gujarat",
      "onwnership": "Public/Government",
      "latest_news_and_events": "The CAT 2024 Advertisement to be released on July 30, 2024. 
      The CAT 2024 exam date is expected to be on November 24, 2024 (last Sunday of November).",
      "description": "Indian Institute of Management Ahmedabad was established in 1961 and it is 
      an autonomous institution by the Govt. of India. The IIM Ahmedabad offers a total of 91 
      courses at the postgraduate and doctoral levels. In the NIRF 2023 ranking, IIM Ahmedabad 
      ranked 1st under the management category. Courses at IIM Ahmedabad include MBA, Executive 
      M.B.A, PGP Food and Agribusiness Management, ePGD in Advanced Business Analytics, ePost 
      Graduate Programme in Management and Ph.D Management. Before applying for admissions at IIM 
      Ahmedabad the candidates should meet the IIM Ahmedabad eligibility criteria. Admissions at 
      IIM Ahmedabad are offered to the students who meet the eligibility criteria and secure the 
      required scores. Admissions to IIM Ahmedabad will be done on the basis of the CAT/GRE/GMAT 
      examination scores. To get shortlisted for admissions to IIM Ahmedabad, candidates need to 
      meet CAT cutoff 2024 as provided by IIM Ahmedabad after the declaration of CAT result 2024.

      IIM Ahmedabad offers various facilities for students and employees. IIM Ahmedabad 
      facilities include separate accommodations, a cafeteria, sports, a gym, a library, 
      an auditorium, a medical/hospital, and many other facilities. IIM Ahmedabad has a 
      distinct placement cell on campus. Placement cell at IIM Ahmedabad gives training 
      and guidance towards the career. The IIM Ahmedabad offers placements for all levels 
      of students.",
      "institute_type": "Institute of National Importance",
      "exam": "GATE, CAT,GMAT, GRE",
      "approvals": "",
      "engineering_fees": "",
      "management_fees": "20 - 25 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "medical_rank": "",
      "management_rank": "1",
      "law_rank": "",
      "fashion_design_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "courses": "MBA, Ph.D"
    },
    {
      "name": "Indian Institute of Management Bangalore",
      "short_name": "IIM-Bangalore",
      "city": "Bangalore",
      "state": "Karnataka",
      "onwnership": "Public/Government",
      "latest_news_and_events": "The CAT 2024 Advertisement to be 
      released on July 30, 2024. 
      The CAT 2024 exam date is expected to be 
      November 24, 2024 (last Sunday of November).",
      "description": "Indian Institute of Management Bangalore was 
      founded in the year 1973 and it has been recognised as 
      an 'Institute of National Importance’. The IIM Bangalore 
      offers multiple courses at the postgraduate and doctoral 
      levels. IIM Bangalore courses include M.B.A, P.G.P, and Ph.D. 
      IIM Bangalore courses are available in online, full-time and 
      part-time mode. The IIM Bangalore has been ranked 2nd in the 
      NIRF rankings 2023 under the management category. Aspiring 
      candidates should meet the IIM Bangalore eligibility criteria. 
      Students interested in enrolling in IIM Bangalore should take 
      the CAT/GMAT/GRE. Admissions at IIM Bangalore are based on the 
      scores secured in the CAT/GMAT/GRE entrance examination. IIM 
      Bangalore offers placements to all levels of programmes. The 
      IIM Bangalore placement cell gives training sessions for students 
      on campus. The IIM Bangalore provides various facilities for 
      students and employees on campus. The IIM Bangalore facilities 
      include a cafeteria, separate accommodations, auditorium, sports, 
      banks/ATMs, medical/hospital and many other facilities. Students 
      who have excellent academic records can also apply for the IIM 
      Bangalore scholarship.",
      "institute_type": "Institute of National Importance",
      "exam": "CAT, GMAT, GRE",
      "approvals": "",
      "engineering_fees": "",
      "management_fess": "20.11 - 24.50 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "2",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "courses": "MBA, Ph.D"
    },
    {
      "name": "Indian Institute of Management Kozhikode",
      "short_name": "IIT-Kozhikode",
      "city": "Kozhikode",
      "state": "Kerala",
      "onwnership": "Public/Government",
      "latest_news_and_events": "The CAT 2024 Advertisement to be released on July 30, 2024. The CAT 2024 exam date is expected to be November 24, 2024 (last Sunday of November).",
      "description": "The Indian Institute of Management Kozhikode was established in the year 1996 and it is one of the 20 Indian Institutes of Management. IIM Kozhikode has bagged the 3rd position in the NIRF 2023 Ranking under the management category. The institute offers multiple courses in various fields. IIM Kozhikode courses are available at postgraduate and doctoral levels. The total number of IIM Kozhikode courses is 75. Students interested in these courses must ensure that they meet the eligibility criteria. The IIM Kozhikode fees are determined by the course chosen by the individual. Those applying for the PGPM course must also take the CAT, whilst those applying for the Post Graduate Programme in Business Leadership must apply and take the CAT/GRE/GMAT. The IIM Kozhikode admissions will be based on the scores obtained in the entrance examination. The shortlisted candidates will proceed to the next process of IIM Kozhikode admission. The institute offers well-structured facilities on campus. The IIM Kozhikode facilities include an auditorium, cafeteria, hostels, computer labs, sports, gym, and many others. The IIM Kozhikode placements are offered for eligible students on campus with a good package.",
      "institute_type": "Institute of National Importance",
      "exam": "CAT, GMAT, GRE",
      "approvals": "",
      "engineering_fees": "",
      "management_fess": "13.12 - 22.50 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "3",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "courses": "MBA, Ph.D"
    },
    {
      "name": "Indian Institute of Management Calcutta",
      "short_name": "IIM-Calcutta",
      "city": "Calcutta",
      "state": "West Bengal",
      "onwnership": "Public/Government",
      "latest_news_and_events": "IIM Calcutta was established 
      in 1961 by the Government of India in collaboration with 
      the Government of West Bengal, Alfred P. Sloan School of 
      Management (MIT), Indian industry and The Ford Foundation. 
      In the NIRF 2023 Ranking, IIM Calcutta secured 99th position 
      in the overall category and 4th position in the management 
      category. Courses at IIM Calcutta include Executive M.B.A, 
      Executive PGP Visionary Leadership and Manufacturing, M.B.A, 
      Post Graduate Diploma in Business Analytics and Ph.D Management. 
      IIM Calcutta M.B.A admission is offered based on the CAT score 
      followed by a Personal Interview (PI) round. Admission to the 
      IIM Calcutta Executive MBA programme is done on the basis of 
      the entrance exam GMAT. Following that, candidates applying 
      for IIM Calcutta are selected based on their academic background, 
      professional experience, GMAT score, personal interview, SoP and 
      recommendation. Admission to IIM Calcutta Executive PGP Visionary 
      Leadership and Manufacturing programme is based on a written test. 

      IIM Calcutta offers many facilities like hostels, auditorium, 
      library, sports, cafeteria, wifi, and placement opportunities 
      to the students. IIM Calcutta's highest salary package stood at 
      Rs 1.15 Crores while IIM Calcutta average salary package stood 
      at Rs 35.07 Lakhs. ",
      "institute_type": "Institute of National Importance",
      "exam": "CAT, GMAT",
      "approvals": "",
      "engineering_fees": "",
      "management_fess": "25 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "4",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "courses": "MBA, Ph.D"
    },
    {
      "name": "Indian Institute of Technology Delhi",
      "short_name": "IIT-Delhi",
      "city": "Delhi",
      "state": "Delhi",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "11.20 - 12.10 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "5",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "JEE Advanced 2024 exam is scheduled to be conducted on May 26, 2024.",
      "description": "Indian Institute of Technology, Roorkee was established in the year 1847. 
      According to NIRF 2023, IIT Roorkee has secured 8th place in the overall category. IIT 
      Roorkee offers courses at different levels such as undergraduate, postgraduate and doctoral 
      levels. The IIT Roorkee courses are available in various fields which include engineering and 
      architecture, sciences, management and business administration, and animation and design streams.",
      "institute_type": "Institute of National Importance",
      "exam": "JEE Advanced, GATE, CAT, JAM, GMAT, CEED, UCEED",
      "approvals": "AICTE",
      "courses": "B.Tech., B.Arch, M.Tech., M.Arch,, MBA, Ph.D, M.Sc., M.Des."
    },
    {
      "name": "Indian Institute of Management Lucknow",
      "short_name": "IIM-Lucknow",
      "city": "Lucknow",
      "state": "Uttar Pradesh",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "9.20 - 26.05 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "6",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "The CAT 2024 Advertisement to be released on July 30, 2024. 
      The CAT 2024 exam date is expected to be November 24, 2024 (last Sunday of November).",
      "description": "The Indian Institute of Management Lucknow was founded in 1984 and was 
      the fourth IIM to be established. IIM Lucknow has secured the 5th rank in the 
      NIRF 2023 Ranking under the management category. IIM Lucknow offers a total of 
      seven programmes at the postgraduate level. The number of courses offered at 
      IIM Lucknow is 46 including MBA, PGP Sustainable Management, MBA Agribusiness 
      Management, MBA for Working Executives, International Programme in Management 
      for Executives, FPM, and Executive FPM are the IIM Lucknow courses. Admission 
      to IIM Lucknow is done based on candidate's scores in entrance exams such as 
      the CAT, GRE, GMAT, XAT, and others. IIM Lucknow has a separate placement cell 
      that handles all the placement activities. Placement cell at IIM Lucknow 
      organises training and grooming sessions for students. The IIM Lucknow 
      scholarships are awarded to students to encourage them to continue their 
      studies. The IIM Lucknow facilities include a cafeteria, separate 
      accommodation, a library, laboratories, an auditorium, medical/hospital ]
      facilities, and many other facilities.",
      "institute_type": "Institute of National Importance",
      "exam": "GATE, CAT, GMAT, GRE, XAT",
      "approvals": "",
      "courses": ""
    },
    {
      "name": "Indian Institute of Management Mumbai",
      "short_name": "IIM-Mumbai(NITIE)",
      "city": "Mumbai",
      "state": "Maharashtra",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "7",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "",
      "description": "National Institute of Industrial Engineering (NITIE) 
      is renamed as Indian Institute of Management Mumbai (IIM Mumbai). 
      NITIE Mumbai is a public institute established in 1963 by the Indian 
      government. IIM Mumbai stood at 7th rank under the management category 
      as per the NIRF 2023 ranking. NITIE Mumbai offers courses in full-time 
      and online modes. IIM Mumbai courses include MBA, MBA Sustainability 
      Management, MBA Operation and Supply Chain Management, PGDM Executive 
      Visionary Leaders For Manufacturing and Fellow Program in Management. 
      NITIE Mumbai admissions to MBA programmes is through CAT and the 
      interview process. IIM Mumbai admissions to the Fellow Program in 
      Management is through CAT/GRE/GMAT/GATE/UGC-JRF. Further, the shortlisted 
      candidates must attend a Written Test, Research Presentation and Personal 
      Interview. Indian Institute of Management Mumbai has a placement committee 
      that oversees the National Institute of Industrial Engineering placements 
      drive. IIM Mumbai placement committee also offers internship opportunities 
      to the students. PG students are offered placements to various organisations 
      at NITIE Mumbai highest salary package of Rs 49 LPA and a median salary 
      package of Rs. Rs 22 LPA. IIM Mumbai facilities include hostels, library, 
      auditorium, cafeteria, sports, gym, medical facilities and many more. ",
      "institute_type": "Institute of National Importance",
      "exam": "CAT",
      "approvals": "AICTE",
      "courses": "MBA"
    },
    {
      "name": "Indian Institute of Management Indore",
      "short_name": "IIM-Indore",
      "city": "Indore",
      "state": "Madhya Pradesh",
      "onwnership": "Public/Government",
      "engineering_fees": "17.60 - 22.12 Lakhs",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "8",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "The CAT 2024 Advertisement to be released on July 30, 2024. 
      The CAT 2024 exam date is expected to be November 24, 2024 (last Sunday of November).",
      "description": "Indian Institute of Management Indore was established in the year 1966. 
      IIM Indore has been ranked 8th in the management category in the NIRF Rankings 2023. IIM 
      Indore offers a total number of 75 courses at postgraduate and doctoral courses. 
      Candidates seeking admission to IIM Indore for the desired course should appear for 
      the relevant entrance examination such as CAT/GMAT. Admissions at IIM Indore are based 
      on the entrance examination scores. IIM Indore offers courses including MBA of 2-years 
      duration, Integrated Programme in Management(IPM) of 5-years duration and Doctoral Programme 
      in Management(DPM) of 4-years duration. Courses at IIM Indore have different fees varying 
      on the course and specialisation chosen by the candidate. 

      IIM Indore offers well-maintained facilities on campus. The IIM Indore facilities include 
      separate accommodation, sports, cafeteria, library, gym, laboratories, transport facility, 
      wifi, and many other facilities. Placement cell at IIM Indore prepares students for mock 
      tests & interviews in order to make students ready for their on-campus placements.",
      "institute_type": "Institute of National Importance",
      "exam": "CAT, GMAT",
      "approvals": "",
      "courses": "MBA"
    },
    {
      "name": "XLRI-Xavier School of Management, Jamshedpur",
      "short_name": "XLRI-Jamshedpur",
      "city": "Jamshedpur",
      "state": "Jharkhand",
      "onwnership": "Private",
      "engineering_fees": "10.72 - 31.20 Lakhs",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "9",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "",
      "description": "Xavier School of Management or XLRI Jamshedpur was 
      established in 1949 by Fr. Quinn Enright, S.J. in the Steel City of 
      Jamshedpur. XLRI Jamshedpur offers ten courses at the postgraduate 
      level. XLRI is accredited by Association to Advance Collegiate 
      Schools of Business (AACSB) and the Association of MBAs (AMBA). 
      It has collaborations with top reputed universities/institutes of the 
      world. XLRI Jamshedpur also provides scholarships to students belonging 
      to economically disadvantaged families based on their performance in 
      academics and/or needs.",
      "institute_type": "",
      "exam": "GMAT, XAT",
      "approvals": "AICTE, UGC",
      "courses": "P.G.D.M, EFPM, FPM,PGDBM"
    },
    {
      "name": "Indian Institute of Management Bombay",
      "short_name": "IIT-Bombay",
      "city": "Kolkata",
      "state": "West Bengal",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "10",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "",
      "institute_type": "State University",
      "exam": "GATE, CAT, MAT, XAT, ATMA, GPAT, JEMAT, WBJECA, WBJEE",
      "approvals": "UGC, AICTE, Council of Architecture, PCI",
      "courses": "B.Tech., B.Pharma, B.Arch, B.Sc., B.A., B.P.Ed, B.Lib.I.Sc, B.Ed, M.Lib.I.Sc, M.Tech, M.Arch, MCA, M.Sc., M.A., M.Phil, Ph.D"
    },
    {
      "name": "Indian Institute of Management Raipur",
      "short_name": "IIM-Raipur",
      "city": "Raipur",
      "state": "Chhattisgarh",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "6.43 - 14.37 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "11",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "IIM CAP 2024 results for IIM Raipur have been released on May 10, 2024. 
      The CAT 2024 notification release date is July 30, 2024, and the registrations will start on August 2, 2024. 
      The CAT 2024 exam is expected to be conducted on November 24, 2024.",
      "description": "Indian Institute of Management (IIM) Raipur was founded in the year 2010 by the Ministry of 
      Human Resource Development, Government of India. The IIM Raipur ranks 11th under the management category in the 
      NIRF Rankings 2023. The institute is a premium management institute which offers postgraduate and doctoral degree 
      courses. IIM Raipur courses include PGP in Management, PGP in Management for Working Executive, Ph.D and more. 
      Students seeking Raipur admission for the Post Graduate Programme in Management must appear for the CAT entrance 
      exam. The candidates should meet the IIM Raipur eligibility criteria for the desired course. The IIM Raipur fees 
      vary from course to course. The institute has a separate Career Development and Placement Office that is 
      responsible for providing training to the students for the IIM Raipur placement. The institute organises training 
      and grooming sessions for students on campus. The IIM Raipur covers an area of about 200 acres equipped with all 
      basic infrastructural facilities on campus. The IIM Raipur facilities include modern classrooms, separate hostels 
      for boys and girls, sports facilities, and access to bank offices/ATMs and others. The institute offers scholarships 
      to deserving students. Scholarships are available for research scholars at IIM Raipur. Students must meet the eligibility 
      requirements to be eligible for IIM Raipur scholarships.",
      "institute_type": "Institute of National Importance",
      "exam": "CAT",
      "approvals": "",
      "courses": "P.G.P.M., Ph.D"
    },
    {
      "name": "Indian Institute of Management Rohtak",
      "short_name": "IIM-Rohtak",
      "city": "Rohtak",
      "state": "Haryana",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "3 - 19.77 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "11",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "The CAT 2024 Advertisement to be released on July 30, 2024. 
      The CAT 2024 exam date is expected to be November 24, 2024 (last Sunday of November).",
      "description": "IIM Rohtak was established in 2009 under the IIM Act of 2017 and was 
      designated as an Institute of National Importance by the MHRD. IIM Rohtak has secured 
      12th rank in the management category of NIRF Ranking 2023. The IIM Rohtak offers 
      undergraduate, postgraduate, and doctoral courses. Courses at IIM Rohtak are available 
      in part-time, full-time, and online study mode. The total number of courses at IIM 
      Rohtak is 17. Courses at IIM Rohtak include 2-year PGPM programme, 1-year EPGP programme, 
      Ph.D in Management and many more. The candidates seeking admission to IIM Rohtak must meet 
      the IIM Rohtak eligibility criteria for the desired course. The candidates should appear for 
      the appropriate entrance exam before applying for admission at IIM Rohtak. IIM Rohtak offers 
      admissions on the basis of CAT/GMAT/GATE/CLAT/GRE score and performance of the candidates 
      in the Personal Interview. 

      Admissions at IIM Rohtak are available for management and business administration and law 
      streams. Placements at IIM Rohtak are offered to all deserving students. Placement cell of 
      IIM Rohtak organises training and grooming sessions for students. IIM Rohtak offers various 
      facilities on campus. The IIM Rohtak facilities include separate accommodations, sports, a 
      cafeteria, a gym, a library, and many other facilities. IIM Rohtak scholarship office 
      provides financial aid to students in the form of scholarships to ensure the cost of 
      education is not a barrier to earning a degree.",
      "institute_type": "Institute of National Importance",
      "exam": "GATE, CAT, GMAT, CLAT,GRE",
      "approvals": "",
      "courses": "MBA, IPM, FPM"
    },
    {
      "name": "Management Development Institute, Gurgaon",
      "city": "Gurgaon",
      "state": "Haryana",
      "onwnership": "Private",
      "engineering_fees": "",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "13",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "The deadline to apply for MDI Gurgaon PGDM 
      Online programme is June 30, 2024 (11:50 PM). MDI Gurgaon PGDM admissions 
      2024 open; apply now. 
      Dr. Avik Sinha (Associate Professor, Economics and Public Policy, Management Development Institute, Gurgaon) was awarded the Careers360 Faculty Research Award in the Economics, Econometrics and Finance domain. He has 117 publications, 4,993 citations and his H-index is 46.",
      "description": "Management Development Institute (MDI), Gurgaon was 
      established in the year 1972. MDI Gurgaon is ranked 13th among the 
      top management schools according to the NIRF 2023 Ranking. The institute 
      offers postgraduate and doctoral-level programmes in management and 
      business administration stream. For admission to MDI Gurgaon PGDM, PGDM-HRM, 
      PGDM-IB and PGDM Business Analytics programmes, candidates need to appear 
      and secure a valid score in the CAT entrance examination (for Indian students). 
      MDI Gurgaon also provides placement opportunities to students studying in 
      their final year. 

      According to the MDI Gurgaon placement data 2023 available, a total of 472 
      students were placed in reputed organisations. The highest salary package 
      stood at Rs. 60 LPA and the median CTC was Rs. 23.13 LPA. MDI Gurgaon also 
      provides scholarships to deserving and meritorious students. Apart from these, 
      the students, faculty and working staff members are provided with various 
      types of MDI Gurgaon campus facilities.",
      "institute_type": "Standalone Institute",
      "exam": "CAT, GMAT, XAT, MAT, CMAT, ATMA",
      "approvals": "AICTE",
      "courses": "PGDM, FPM"
    },
    {
      "name": "Indian Institute of Technology Kharagpur",
      "short_name": "IIT-Kharagpur",
      "city": "Kharagpur",
      "state": "West Bengal",
      "onwnership": "Public/Government",
      "latest_news_and_events": "JEE Advanced examination will be held on May 26, 2024.",
      "description": "Indian Institute of Technology was founded in the year 1951 by the 
      Ministry of Human Resource Development, Government of India. IIT Kharagpur is placed 
      7th under the overall category in the NIRF Ranking 2023. The institute offers multiple 
      courses at undergraduate, postgraduate, and doctoral level courses. The total number 
      of courses at IIT Kharagpur is around 464. IIT Kharagpur has been ranked 271 position 
      in the QS Ranking.",
      "exam": "GATE, JEE Advanced, JAM",
      "institute_type": "Institute of National Importance",
      "approvals": "",
      "engineering_fees": "",
      "management_fess": "14",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "courses": ""
    },
    {
      "name": "Indian Institute of Technology Madras",
      "short_name": "IIT-Madras",
      "city": "Chennai",
      "state": "Tamil Nadu",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "15",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "1) 2nd International Conference on Recent Advances in 
      Applied Mathematics (RAAM 2024) will be held in IIT BHU from July 3, 2024 to July 5, 2024. 
      2) JEE Advanced 2024 exam is scheduled to be conducted on May 26, 2024. 
      3) The last date to download the GATE 2024 scorecard is May 31, 2024. 
      4) JoSAA Counselling registration will be commencing on June 10, 2024.",
      "description": "Indian Institute of Technology Banaras Hindu University, 
      Varanasi, was established in 1919 as Banaras Engineering College. IIT BHU 
      was ranked 15th in the engineering category and 31st in overall category by 
      NIRF 2023 ranking. IIT BHU courses are offered at UG, PG and doctoral levels. 
      The IIT BHU Varanasi courses include B.Tech., B.Arch., B.Tech+M.Tech., M.Tech., 
      M.Pharm and Ph.D.",
      "exam": "GATE, JEE Advanced",
      "institute_type": "Institute of National Importance",
      "approvals": "Council of Architecture",
      "courses": "B.Tech, B.Arch, M.Tech, M.Pharm, Ph.D"
    },
    {
      "name": "Indian Institute of Management Udaipur",
      "short_name": "IIM-Udaipur",
      "city": "Udaipur",
      "state": "Rajasthan",
      "onwnership": "Public/Government",
      "engineering_fees": "",
      "management_fess": "14.21 - 21.75 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "16",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "IIM CAP 2024 results for IIM Udaipur 
      have been released on May 10, 2024. IIMU EMBA admissions 2024 are open. 
      IIM Udaipur MBA admission for International applicants (cycle 2 admission) 
      for the academic session 2024-25 is open.",
      "description": "Indian Institute of Management Udaipur which is widely renowned 
      as IIM Udaipur was established in the year 2011 and it is an institute well-known 
      for its teaching expertise and education quality. IIM Udaipur's ranking as per 
      NIRF is 16 under the management category. IIM Udaipur courses include MBA, MBA 
      in Digital Enterprise Management, MBA in Global Supply Chain Management, EMBA at 
      the postgraduate level and PhD programmes at the doctoral level. 
      IIM Udaipur admission is offered based on the scores of the CAT/ GMAT/ GRE/ NET-JRF 
      followed by a physical appearance on the IIMU campus for a personal interview (PI) 
      and writing ability test (WAT) round. As per the NIRF ‘2023’ report, a total of 392 
      students were placed during the IIM Udaipur placements 2022 with Rs 20,00,000 per 
      annum being the IIM Udaipur Median salary package offered. Some of the top recruiters 
      that participated in the IIM Udaipur placements drive are Flipkart, Cisco, IDFC First 
      Bank, India First, Cipla Health, Colour Tokens and more. IIM Udaipur campus size is 
      over an area of 300 acres with the IIM Udaipur infrastructure surrounding all of its 
      academic and administrative buildings, classrooms, auditoriums, hostels, laboratories 
      and more. IIM Udaipur campus offers facilities such as hostels, an auditorium, a library, 
      sports facilities, a cafeteria, wifi, laboratories and a medical clinic that are 
      provided to the students on the IIM Udaipur campus.",
      "exam": "CAT, GMAT",
      "institute_type": "Institute of National Importance",
      "approvals": "",
      "courses": "MBA, EMBA, Ph.D"
    },
    {
      "name": "Symbiosis Institute of Business Management, Pune",
      "short_name": "SIBM-Pune",
      "city": "Pune",
      "state": "Maharashtra",
      "onwnership": "Private",
      "engineering_fees": "",
      "management_fess": "17",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "latest_news_and_events": "1) Symbiosis Institute of Business Management, 
      Pune had hosting Mr. Sriram S., Director and Head HR, Arcesium India Pvt. 
      Ltd. as part of the Catapult Leadership Talk Series. 2) The students of SIBM 
      Pune had attend an intriguing session on the topic ‘Customer led business 
      transformation and changing business landscape’ hosting Mr. Mayank Jain, 
      National Sales Operations and Retail Marketing, Fastrack, Titan Company 
      Limited as a part of the Lumiere - Guest Lecture Series organised by the 
      Research and Scholastic Development Team. 3) Symbiosis Institute of Business 
      Management Pune had hosted Ms. Anshu Mordia, Head HR, Logistics, India 
      Subcontinent, DP World as a part of the Catapult Leadership Talk Series.",
      "description": "Symbiosis Institute of Business Management (SIBM), Pune is a 
      private management institute established in the year 1978. SIBM Pune is a 
      constituent institute of Symbiosis International University (SIU), Pune. 
      The institute is accredited by NAAC with "A" grade. SIBM Pune offers 4 courses 
      that include M.B.A, Executive M.B.A, M.B.A Innovation and Entrepreneurship 
      and PGDBM programmes in various specialisations. It also offers online 
      courses in the fields of Marketing Analytics, Design Thinking, Fundamentals 
      of Management and Business Analytics & Digital Marketing. SIBM Pune has 
      secured 17th rank under the management category in NIRF 2022 Rankings. SIBM 
      Pune has also completed M.B.A placements for the year 2022. SIBM Pune placements 
      2022 had an average salary package of Rs. 23.06 LPA and the highest package of 
      Rs. 45.50 LPA. In the meantime, M.B.A students received the highest stipend of 
      Rs. 3.50 lakhs per month during the Summer Internship Recruitment Programme 2021 
      for the 44th M.B.A Flagship batch of 2021-23. SIBM Pune offers scholarships to 
      M.B.A and M.B.A (I&E) students for up to 50% of the academic fee.",
      "exam": "SNAP",
      "institute_type": "Constituent College",
      "approvals": "",
      "courses": "MBA, PGDBM",
    },
    {
      "name": "Indian Institute of Technology Roorkee",
      "short_name": "IIT-Roorkee",
      "city": "Roorkee",
      "state": "Haryana",
      "onwnership": "Public/Government",
      "latest_news_and_events": "1) The last date to download the GATE 2024 scorecard is 
      May 31, 2024. 2) GATE COAP Round 1 Seat Allotment is expected to be out on May 13, 
      2024, at 10 AM.",
      "description": "The Indian Institute of Technology Gandhinagar was established in the 
      year 2008 and it is recognised as an 'Institute of National Importance'. The IIT Gandhinagar 
      has been ranked 18th in the engineering category and 24th in the overall category under the 
      NIRF 2023. IIT Gandhinagar has secured 31st rank in the NIRF Research Ranking 2023.  IITGN 
      offers multiple courses on its campus including bachelor's, master's and doctoral-level 
      programmes in various disciplines.",
      "exam": "GATE, JEE Advanced, JAM",
      "institute_type": "Institute of National Importance",
      "approvals": "",
      "engineering_fees": "",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "18",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "courses": ""
    },
    {
      "name": "Indian Institute of Management Kashipur",
      "short_name": "IIM-Kashipur",
      "city": "Kashipur",
      "state": "Uttarakhand",
      "onwnership": "Public/Government",
      "latest_news_and_events": "1) IIM CAP 2024 results has been released by IIM Kashipur on 
      May 10, 2024. 2) The CAT 2024 notification release date is July 30, 2024, and the 
      registrations will start on August 2, 2024. 3) The CAT 2024 exam is expected to be 
      conducted on November 24, 2024.",
      "description": "Indian Institute of Management Kashipur, (IIM Kashipur) was established 
      in 2011 by the Government of India as a constituent institute of IIM. Courses offered by 
      IIM Kashipur are MBA, MBA Analytics, Executive MBA, Executive MBA (Analytics) and PhD. 
      IIM Kashipur admissions are entirely entrance-based. Admission to the MBA offered by 
      IIM Kashipur is done through CAT. IIM Kashipur also offers scholarships like Need cum 
      Merit-Based Financial Assistance. Indian Institute of Management Kashipur placement 
      team helps in the placement of the students. The campus of the institute spreads over 
      an area of 200 acres of land. IIM Kashipur offers management-related education and 
      research programmes under the Ministry of Education, Government of India. As per the 
      NIRF Ranking 2023, the IIM Kashipur ranking among other IIMs is 19th in the management 
      category. IIM Kashipur is also accredited by the Association to Advance Collegiate Schools 
      of Business (AACSB).",
      "exam": "CAT, GMAT",
      "institute_type": "Institute of National Importance",
      "approvals": "",
      "engineering_fees": "",
      "management_fess": "16.96 - 17.21 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "19",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "courses": "MBA, Ph.D"
    },
    {
      "name": "SPJIMR, Mumbai",
      "short_name": "SPJIMR-Mumbai",
      "city": "Mumbai",
      "state": "Maharashtra",
      "onwnership": "Private",
      "latest_news_and_events": "1) As per the QS Global MBA Rankings 2023, SPJIMR Mumbai is part of the 151-200 rank bracket for the fourth consecutive year. 
      2) In the FT MiM 2023 ranking, SPJIMR has secured the 1st spot in India and 40th spot Globally. 
      3) Dr. Shalini Talwar  (Associate Professor, Finance and Economics, and Research 
      Lead, Centre for Innovation in Sustainable  Development (CISD), S.P. Jain 
      Institute of Management and Research) was awarded the Careers360 Faculty 
      Research Award in the Decision Sciences domain. He has 68 publications, 
      2,022 citations and his H-index is 31. 
      4) CAT result 2023 announced. Candidates can apply for SP Jain Institute of Management and Research college admission based on the latest CAT cutoff.",
      "description": "SP Jain Institute of Management and Research (SPJIMR, Mumbai) is a member of 
      Bhartiya Vidya Bhavan established in 1981. SPJIMR, Mumbai is accredited by the National 
      Board of Accreditation (NBA), The Association of MBAs (AMBA), UK and The Association to Advance 
      Collegiate Schools of Business (AACSB). SP Jain Institute of Management and Research is also 
      approved by the All India Council for Technical Education (AICTE). The institute offers PG courses 
      under the streams of management and business administration. As per the NIRF 2023 Ranking, SPJIMR 
      Mumbai is ranked 20th in the management category. SP Jain Institute of Management and Research 
      courses include Post Graduate Diploma in Management, Post Graduate Programme in Management, 
      Post Graduate Executive Management Programme, Post Graduate Management Programme for Women, Post Graduate Programme in Development Management, Post Graduate Programme in Family Managed Business and Fellow Programme in Management. 

      As per SPJIMR, Mumbai placements 2024 for the two-year PGDM and PGDM(BM) programme available, the highest and average salary package stood at Rs. 81 LPA and Rs. 33 LPA respectively. Students can also enroll for various scholarships offered at the institute. Some of the offered scholarships are Merit cum Means Based Financial Assistance and many more. ",
      "exam": "GATE, JEE Main, CAT, GMAT, MAT, XAT, SNAP, CMAT, NMAT, GRE",
      "institute_type": "Standalone Institute",
      "approvals": "AICTE",
      "engineering_rank": "",
      "management_rank": "20",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "",
      "overall_rank": "",
      "engineering_fees": "",
      "management_fess": "3 Lakhs - 23.50 Lakhs",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "courses": "PGDM, FPM"
    },
    {
      "name": "Narsee Monjee Institute of Management Studies, Mumbai",
      "city": "Mumbai",
      "state": "Maharashtra",
      "onwnership": "Private",
      "short_name": "NMIMS Mumbai",
      "latest_news_and_events": "NMIMS Mumbai admissions 2024 are open 
      for all courses. Eligible candidates can apply by visiting the 
      official website of the university. ",
      "description": "Narsee Monjee Institute of Management Studies (NMIMS), 
      Mumbai is a private institution which was established in 1981. The 
      institution has been accredited by NAAC (National Assessment and 
      Accreditation Council) with an A+ Grade. NMIMS Mumbai holds the 88th 
      position in the overall category according to the NIRF Ranking 2023. 
      The institute offers a wide range of courses at the undergraduate, 
      postgraduate, and doctoral levels. NMIMS Mumbai courses include B.Tech, 
      BBA, B.Sc, BA, MBA, M.Pharm, Ph.D, and many others. Students are required 
      to meet the NMIMS Mumbai eligibility criteria to get enrol in  Narsee 
      Monjee Institute of Management Studies courses.",
      "exam": "NATA, CLAT, CLAT PG, NMAT, GPAT, NMIMS DAT, NPAT, JEE Main,IELTS, 
      TOEFL, NMIMS-LAT, NMIMS-CET, NPAT",
      "institute_type": "Deemed to be University",
      "approvals": "UGC",
      "engineering_fees": "101 - 150",
      "management_fess": "",
      "fashion_design_fees": "",
      "medical_fees": "",
      "law_fees": "",
      "pharmacy_fees": "",
      "engineering_rank": "",
      "management_rank": "21",
      "fashion_design_rank": "",
      "medical_rank": "",
      "law_rank": "",
      "pharmacy_rank": "11",
      "overall_rank": "",
      "courses": "88"
    }
  ]
  